// ALL Azure Activity Log QUERIES

// Table: Most Active Users & Their Activities
AzureActivity
| where Caller has "@"
| summarize Activities = count() by Caller, OperationName
| sort by Activities

// Table: Users Performing Unauthorized Activities
AzureActivity
| where ActivitySubstatus == "Unauthorized" and Caller has "@"
| extend eventProperties = parse_json(Properties)
| extend eventStatus = tostring(parse_json(eventProperties.statusMessage))
| extend Reason = extractjson("$.error.message", eventStatus)
| project Reason, Caller, CallerIpAddress, OperationName , ResourceGroup, EventSubmissionTimestamp
| sort by Reason asc, Caller asc
